{
    "pages": [
      {
        "pageNumber": 1,
        "text": "https://edcite.zohodesk.com/portal/en/kb/articles/product-updates Edcite Product Updates On this document, you will find information on updates to: Edcite, free state-aligned digital practice Edcite Schools, our premium school and district assessment platform DataHub by Edcite, our centralized data management system Want to share a priority for you or your team or learn more about these priorities? Please email schools@edcite.com with 'Product Priorities' in the subject. Alternatively, you can sign up here for some office hours with Edcite Director of Products, Brian McIntosh. If you don't see a time that works for you, email brian@edcite.com to set something up. Coming Soon: New Edcite interface! A.I. assisted essay grading! Calculator updates. Admin Homepage update (Edcite Schools only). Assessment viewer alignment enhancements. Spring 2024 1. New Content: New York State Test 2021, New York State Test 2022, MAAP Practice Tests 2023 (Mississippi) 2. PDF Upload Tool: i) PDFs can now be uploaded directly to a question by clicking the PDF icon in the Rich Text Editor, ii) PDFs can now be uploaded as reference sheets for students to use as they take an assignment. Winter 2023/2024 1. New Content: New York State Test 2023, STAAR 2023 (Texas), MCAS 2023 (Massachusetts), OST 2023 (Ohio), KSA Practice Tests (Kentucky). 2. Text-to-speech feature enhancement: tracking (the highlighting of words as they are read) is now supported (Edcite Schools only). 3. Performance Bands update: admins can now import performance bands from one distribution to another distribution.",
        "images": []
      },
      {
        "pageNumber": 2,
        "text": "https://edcite.zohodesk.com/portal/en/kb/articles/product-updates 4. The Graph Points and Lines (#083) question type now allows group scoring. 5. Text editor enhancements: you can now use shortcuts for subscript and superscript. Spring 2023 1. New question type: The Choose Graph (#104) question asks students to choose between different graphs and then plot the chosen graph. Winter 2022/2023 (Click Here to Learn More) 1. New content: OST 2022 (Ohio), MCAS 2022 (Massachusetts), CMAS 2022 (Colorado), STAAR 2022 (Texas,) ILEARN 2022 (Indiana), AASA 2021 (Arizona). 2. Reports Hub upgrade to improve user experience. 3. Bubble Sheets: scanning and grading upgrades (Edcite Schools only). 4. Extended Select Answer (#001) question type now has all or none and teacher-graded scoring options. 5. You can now lock assessments from the Assignment Editor page by clicking the Lock symbol next to the Settings Gear. 6. Content Clarifiers - students can now access teacher-created clarifications for words and phrases. Click here to learn more. 7. Text-to-speech is now available in Spanish (Edcite Schools only). 8. The Touch Image (#123) question type now allows you to choose between a rectangle, a circle, or free drawing to outline an answer area. 9. 'Blind Assessments': this setting is enabled by an assessment's creator (an admin) and it restricts teachers from being able to view or print the assessment, or see the answer key. 10. A Dictionary Tool is now available to students in Texas (Edcite Schools only). 11. Ruler update: centimeters and inches now appear on one ruler. Summer 2022 (Click Here to Learn More) 1. Batch force submit and unsubmit: you can now force submit or unsubmit student work in bulk on the Grading page (Edcite Schools only). 2. New content: 2022 ACAP Tests (Alabama) and 2021 STAAR Tests (Texas). 3. The rich text editor has a fresh, new look with additional shortcut options and updated image resizing. 4. Grid View update: you can now toggle between takes using a dropdown menu. 5. Bubble Sheets update: bubble sheets can now be printed for Multiple Choice questions, Free Response questions, and/or Essay Response questions (Edcite Schools only). Spring 2022",
        "images": []
      },
      {
        "pageNumber": 3,
        "text": "https://edcite.zohodesk.com/portal/en/kb/articles/product-updates 1. FREE Common Assessments Initiative: with state testing around the corner, we've added a button on the Teacher Homepage to our FREE Common Assessments Initiative. Send students released state tests in our premium state-aligned viewer and get instant data! 2. The Pictograph Answer (#026) question type now has a setting to enable clicking on an image to add it to a pictograph. 3. On the Dot Plot Answer (#020) question type, you can now select an 'X' or a 'Dot' as a point indicator. Winter 2021/2022 1. Multiple Choice (#005) scoring update: this question type can now be teacher-graded 2. Drag and Drop - Text (#021) question type now has the option for a background image to be added 3. The Question Bank now has a filter to search by question type 4. New content: 2021-2022 Ohio State Tests 5. Assignment Editor update: questions can now be sorted by name or by points 6. Standards update: California teachers can now search for and tag ELA Claims and Targets 7. New DataHub features: i. Export a full dashboard as HTML or PDF (either one report per page or multiple per page) ii. Export individual reports as PDF, HTML, or the underlying data as a CSV Fall 2021 1. The Assignment Library now has a “State Released Tests” filter, making it easy to search for high-quality assessments (click here to learn more) 2. Item Analysis Report update: report now displays data for Table CheckBox Answer (#010). Click here to learn more about this report. 3. New content: 2021 MCAS Released Tests and 2018 STAAR Tests 4. Custom District Data Tools: New data collection tools are now available for Edcite Schools users that want to capture additional student data, beyond what is directly captured from student work on Edcite. Click here to learn more! Summer 2021 (Click HERE to Learn More) 1. Grading Improvements i) New Grid View ii) Rubric Update: Inline Rubric Grading 2. Venn Diagram (#046) Question Type Update 3. Assignment Editor Updates: New Fields 4. One Tab at a Time: Students Restricted to One Tab for Assignments",
        "images": []
      },
      {
        "pageNumber": 4,
        "text": "https://edcite.zohodesk.com/portal/en/kb/articles/product-updates 5. Student Report: Updated Settings for Hiding Correct Answers/Scores 6. New Integrations (Edcite Schools Only): Schoology and Aeries Winter 2020/2021 1. TTS Alignment to State Specific Viewers 2. Attach Pictures of Student Work to Question Summer 2020 1. Focus Tracker 2. Real Time Connect 3. Improve Audio Recording / Auto Play Recorded Audio / Audio Record Type for Students 4. Sectioned Assignments - choose different settings by assignment section Winter 2019/2020 1. Student Group Assignment Settings (Edcite Schools Only) 2. Class Term Column Added - Populates from Clever (Edcite Schools Only) 3. Scoring Updates to Align with State Assessments - Teacher Graded + All or Nothing Scoring Added for Multiple Question Types 4. Question Bank - New Card View 5. New State Assessment Viewers - Coming Soon! September 2020 1. Question Bank - State Aligned Items Filter",
        "images": []
      },
      {
        "pageNumber": 5,
        "text": "https://edcite.zohodesk.com/portal/en/kb/articles/product-updates Summer 2019 1. New Student Interface 2. New Question and Assignment Viewers 3. Updated My Assignments 4. Updated My Questions April 2018 1. Added Oklahoma Standards 2. Added South Carolina Standards 3. Added Multiple Choice under ACT Aspire Q type list 4. New Admin Help Solutions - Mapped to specific pages 5. Added New Jersey Standards 6. Share Collection Page - Shows Follower / Following button 7. Matching Item Type - removed tries allowed March 2018 1. Get Assignment Pathway for Non-Logged In teachers to copy newly found content easily into their account 2. Logging in for QL will allow students to save work 3. Added Enhancements for Admin Sign In As Teacher or Sign In As Student 4. Florida Common Assessments Initiative Launched 5. Missouri Common Assessments Initiative Launched 6. Item Analysis Report - Click to View Students instead of Hover 7. Admin Activity Report - for admin and subadmins. If you'd like to try this out, email us at hello@edcite.com 8. Student Notes Available in Saved Answer History 9. Updated AIR Graphing Calculator - can evaluate expressions, closer alignment to real calculator 10. #062 SBAC Keypad Question Editor - Added grade level setting to customize keypad 11. Arizona Common Assessments Landing Page 12. Massachusetts Common Assessments Landing Page 13. Draw Points / Lines Question Type - student draw functionality now matches SBAC, AIR and FSA tests 14. Drag and Drop (math and text) - can now put answer bank at 'bottom' (below student response area) 15. SBAC / AIR / FSA Viewer - added context menu to match viewer on state assessment 16. Added student name and rosterid to Teacher Standards Report",
        "images": []
      },
      {
        "pageNumber": 6,
        "text": "https://edcite.zohodesk.com/portal/en/kb/articles/product-updates February 2018 1. SBAC Viewer - Updated to match recent SBAC changes 2. No Class Specified Option - for Edcite Schools teacher managing students without roster access 3. Updated Alert Message to new look 4. Teacher Reports Hub - District Distributed: Item Analysis Report and Standards Growth Report Added 5. Essay Response #100 - Option to restrict the characters in student response 6. New Admin Assignment Editor 7. Added Georgia State Standards 8. Questar Viewer - Limited Release (for feedback) 9. Essay Type Viewer Now Supports all Rich Text Editing Options 10. New Admin Assignment Editor 11. Assignment Dashboard - If more than 20 students, question numbers will show at bottom (Shout out to Dave Limbaugh in OH for this suggestion!) 12. Super Bowl Landing Page 13. Class Names show up when you hover over the abbreviated class name on home page and class dashboard - good for longer class names from Clever 14. Item Analysis Report for OCA's - Pulls opt in data for a particular common assessment. Available on OCA Reports Page. 15. OCA Summary Report - Shows teacher's own students' data AND aggregate opt in data for that particular common assignment. 16. DRC Viewer - Available in Edcite Schools 17. Questar Viewer - Available in Edcite Schools January 2018 1. Teachers can restore answers from Saved Student Work and Regrade using the restored answer 2. [ES Only] Teacher Authorization Form - Individual Teacher Setup. Fills out with teacher's own restrictions 3. Added Mississippi State Standards 4. Quick Link Page for Students - Updated look and feel to encourage students to login 5. Teachers and Sub-Admin with ALL Distribution folder access will be able to access distributions that are not in folders 6. New Sign In with Google button on Login page 7. Common Assessments Page for Teachers - Teacher Assigned - Assign button will open most recent copy of assignment instead of generating a new copy. New copies can still be made from My Assignments page. 8. AIR Viewer - Paginated stimulus 9. AIR Viewer Look Updated with new Numbering and Top Design (Pagination coming soon!)",
        "images": []
      },
      {
        "pageNumber": 7,
        "text": "https://edcite.zohodesk.com/portal/en/kb/articles/product-updates 10. AIR Graphing Calculator is Available with AIR Viewer 11. Updated OH Standard Codes 12. Anonymous Quick Link Student Work - Saved on Grading Page 13. User Management Data Structure Updated to allow admin account to manage user access and set up new sub admins 14. Sub Admin will be able to access pages that they are given access to instead of getting full access",
        "images": []
      }
    ]
  }
  